/**
  ******************************************************************************
  * @file    py32f002b_it.c
  * @author  MCU 应用团队
  * @brief   中断服务程序。
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* 包含头文件 ----------------------------------------------------------------*/
#include "main.h"
#include "py32f002b_it.h"



/* 私有包含 ------------------------------------------------------------------*/
/* 私有类型定义 --------------------------------------------------------------*/
/* 私有宏定义 ----------------------------------------------------------------*/
/* 私有宏 ---------------------------------------------------------------------*/
/* 私有变量 ------------------------------------------------------------------*/
/* 私有函数原型 --------------------------------------------------------------*/
/* 私有用户代码 --------------------------------------------------------------*/
/* 外部变量 ------------------------------------------------------------------*/

/******************************************************************************/
/*          Cortex-M0+ 处理器中断与异常处理函数          */
/******************************************************************************/
/**
  * @brief  此函数处理不可屏蔽中断（NMI）。
  */
void NMI_Handler(void)
{
}

/**
  * @brief  此函数处理 HardFault 硬故障中断。
  */
void HardFault_Handler(void)
{
  while (1)
  {
  }
}

/**
  * @brief  此函数处理通过 SWI 指令触发的系统调用。
  */
void SVC_Handler(void)
{
}

/**
  * @brief  此函数处理可挂起的系统服务请求（PendSV）。
  */
void PendSV_Handler(void)
{
}

/**
  * @brief  此函数处理系统节拍定时器（SysTick）。
  */
void SysTick_Handler(void)
{
  HAL_IncTick();
  APP_OnSysTick1ms();
}

/******************************************************************************/
/* PY32F002B 外设中断处理函数                                     */
/* 在此处添加所用外设的中断处理函数。                             */
/* 可用的外设中断处理函数名称请参照启动文件。                   */
/******************************************************************************/

/************************ (C) COPYRIGHT Puya *****文件结束******************/
